app/Controllers/Film.php

SELECT *
FROM `films`
---
    public function index()
    {
        $data['films'] = $this->FilmModel->findAll();

SELECT *
FROM `films`
WHERE `films`.`id` = '8'
---
    public function detail($id = null)
    {
        $data['film'] = $this->FilmModel->find($id);