app/Controllers/Home.php

    public function index()
    {
        $filmModel = new FilmModel();
        $data['films'] = $filmModel->findAll();
---
SELECT *
FROM `films`